Show / Hide Table of Contents
Class ConnectionPoint
ConnectedDesignMemeber
Inheritance
System.Object
OpenObject
OpenElementId
ConnectionPoint
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.ConnectionPoint,CI.StructuralElements", "CI.StructModel.Structure.IConnectionPoint,CI.BasicTypes")]
public class ConnectionPoint : OpenElementId
Constructors
Improve this Doc   View Source
ConnectionPoint()
Constructor
Declaration
public ConnectionPoint()
Properties
Improve this Doc   View Source
BearingMember
Bearing Member
Declaration
public ReferenceElement BearingMember { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
ConnectedMembers
Connected members as collection of IDs.
Declaration
public List<ConnectedMember> ConnectedMembers { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ConnectedMember>
Improve this Doc   View Source
Name
Name of Element
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Node
Node
Declaration
public ReferenceElement Node { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
NodeId
Id of node
Declaration
[Obsolete("Use the Node reference element.")]
public int NodeId { get; set; }
Property Value
 Type |  Description
 System.Int32
Remarks
This property is not longer supported. Use the Node property instead of this one.
Improve this Doc   View Source
NodeIdSerialize
Gets or sets the Id of node for Xml serialization (back compatibility).
Declaration
public int NodeIdSerialize { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
ProjectFileName
Set filename for Connection
Declaration
public string ProjectFileName { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source